000100* FizzBuzz implementation
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. FizzBuzz.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 WS-CNT PIC 9(3) VALUE 1.
000650 01 WS-REM PIC 9(2) VALUE 1.
000700 PROCEDURE DIVISION.
000800 A-PARA.
000900 PERFORM B-PARA 100 TIMES.
001000 STOP RUN.
001100 B-PARA.
001200 EVALUATE TRUE
001300 WHEN FUNCTION MOD (WS-CNT, 15) IS ZERO
001400 DISPLAY 'FizzBuzz'
001500 WHEN FUNCTION MOD (WS-CNT, 10) IS ZERO
001600 DISPLAY 'Buzz'
001700 WHEN FUNCTION MOD (WS-CNT, 5) IS ZERO
001800 DISPLAY 'Fizz'
001900 WHEN OTHER
002000 DISPLAY ' 'WS-CNT
002100 END-EVALUATE.
002200 ADD 1 TO WS-CNT.
